# 2018-09-10

[TOC]

# 学习cisco 交换机模拟器的使用

## REF

https://blog.csdn.net/al_assad/article/details/70255987

## 配置远程登陆控制/telnet

配置前后变化

```
//前
line con 0
!
line vty 0 4
 login
line vty 5 15
 login
!
!
!
```
配置命令：

```
Switch(config)#line vty 0 4         //进入远程登录用户管理视图，0-4个用户
Switch(config-line)#login           //打开登录认证功能
Switch(config-line)#password cisco  //配置远程登录的密码为5ijsj，密码明码显示
Switch(config-line)#privilege level 1  //配置远程登录用户的权限为最低权限1（最高权限3）
Switch(config-line)#end 
          
Switch#show run   //显示当前交换机配置情况
```



```
//后
line con 0
!
line vty 0 4
 password cisco
 login
line vty 5 15
 login
!
!
!
end
```

## 配置vlan

ref：

http://7c0bab95.wiz03.com/share/s/1Y2WKl218k5e2gpBCl2BeEsq355ZOg0OJQ6E2ECMEz3iwZTE

结果：

![](http://o6qns6y6x.bkt.clouddn.com/18-9-10/32356473.jpg)


# 学会使用后，来做些锐捷相关的

## 三层交换机实现VLAN间路由（svi）

### ref： 

http://7c0bab95.wiz03.com/share/s/1Y2WKl218k5e2gpBCl2BeEsq0Yy3ew3HcQys2wxOLl08agY4


### 过程：

创建vlan 的过程略

通过这样的命令来指定端口的vlan


```
  //将终端端口绑定到vlan指定分组
Switch(config )#inter fa 0/2    
Switch(config-if)#switchport access vlan 2  
Switch(config-if)#exit   
Switch(config )#inter fa 0/3  
Switch(config-if)#switchport access vlan 3
Switch(config-if)#exit  
```

然后制作svi 的工序如下：

```
//对2个vlan虚拟接口进行路由转发配置
Switch(config )#inter vlan 2      //进入vlan2 虚拟接口
Switch(config-if)#ip address 192.168.1.1 255.255.255.0  //配置IP地址
Switch(config-if)#no shutdown        //开启该三层端口（路由功能）
Switch(config-if)#exit
Switch(config )#inter vlan 3
Switch(config-if)#ip address 192.168.2.1 255.255.255.0
Switch(config-if)#no shutdown
Switch(config-if)#end
```

#### 心得：

上述命令中：`ip address 192.168.2.1 255.255.255.0`,这是实际有效的，说实际有效是因为，
我们之前在*配置vlan*一节中给定每个pc的默认网关是：`192.168.1.1`,但实际上，交换机没有提供任何和ip相关的功能，任何网关的配置对PC和交换机都是无效的（因为我们的网络中没有路由元件），所以新增加的命令：
`ip address 192.168.2.1 255.255.255.0`，是实际有效的，交换机现在提供两个虚拟出来的类似三层迷你路由，一个迷你路由路由`1.0`网段（aka： vlan 2），一个路由
（aka：`#ip address 192.168.2.1 255.255.255.0`配置的）路由`2.0`网段（aka： vlan 3）


### 结果：

![](http://o6qns6y6x.bkt.clouddn.com/18-9-10/73060166.jpg)


## STP 实践


### ref

http://7c0bab95.wiz03.com/share/s/1Y2WKl218k5e2gpBCl2BeEsq0GbRcP2tT4Ax2iP4fP0vayk2


### 过程


#### 先配置好各个机器，再搭建网络吧

配置交换机：

```
Switch>en
Switch#conf t
Switch(config)#vlan 10
Switch(config-vlan)#exit
Switch(config)#inter fa 0/10   //将fa 0/10 端口绑定到 vlan10
Switch(config-if)#switchport access vlan 10
Switch(config-if)#exit
Switch(config)#inter rang fa 0/1 - 2
Switch(config-range)#switchport mode trunk  //将 fa0/1 fa0/2端口工作模式改为 trunk
Switch(config-range)#exit
Switch(config)#spanning-tree mode rapid-pvst     //指定生成树协议的类型为RSTP 
Switch(config)#end
```

#### 看看现有的正常stp效果

![](http://o6qns6y6x.bkt.clouddn.com/18-9-10/14250937.jpg)

#### 看看关闭0/1口的结果：仍旧ping通

![](http://o6qns6y6x.bkt.clouddn.com/18-9-10/33811367.jpg)

### 后记

#### 往vlan添加端口

```
Switch(config)#interface fa 0/1   //切换到fa 0/1端口，并将该端口绑定到vlan2
Switch(config-if)#switch access vlan 2 
Switch(config-if)#exit
```


# 三层验证中的基本路由功能验证

一开始，我们的连接没有两端都是绿色的时候，pc的arp表项为空。等联通之后，就有了，如下图：

![](http://o6qns6y6x.bkt.clouddn.com/18-9-10/57368560.jpg)

注：交换机新建一个vlan，似乎就会为这个不是1的vlan，（比如上图的vlan2 ： 00e0.b081.8a01），分配一个mac。要知道，交换机的mac是：`00E0.B081.8A3B`

注注： 怎么查看交换机的mac呢？by `show version`

你虽然在pc上看到了我们vlan2 的mac，但是似乎交换机还不知道pc的mac，你要用交换机ping一下，然后我们的交换机能知道了pc在哪：

```
Switch#show mac address-table 
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----

Switch#ping 192.168.204.42

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.204.42, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 0/0/1 ms

Switch#show mac address-table 
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----

   2    0001.97c9.3987    DYNAMIC     Fa0/1
Switch#
```

## 跨vlan路由来了！

情况是这么个情况：

![](http://o6qns6y6x.bkt.clouddn.com/18-9-10/69487229.jpg)

pc1 ping pc4 

现在呢，pc 1 (`arp -a`) 知道	自己的网关在哪（交换机vlan2的svi那里），但是不知道pc4 在哪。交换机也仅仅知道pc1在端口1，aka mac地址 ` 0001.97c9.3987`和`fastEthernet 0/1` 对应

### ping一下吧

路线是

#### 在pc这边

一： L3

```
1. The Ping process starts the next ping request.
2. The Ping process creates an ICMP Echo Request message and sends it to the lower process.
3. The source IP address is not specified. The device sets it to the port's IP address.
4. The destination IP address is not in the same subnet and is not the broadcast address.
5. The default gateway is set. The device sets the next-hop to default gateway.
```

二： L2

```
1. The next-hop IP address is a unicast. The ARP process looks it up in the ARP table.
2. The next-hop IP address is in the ARP table. The ARP process sets the frame's destination MAC address to the one found in the table.
3. The device encapsulates the PDU into an Ethernet frame.
```


三： L1

```
1. FastEthernet0 sends out the frame.
```

#### 首次到达交换机

一： L1

```
1. FastEthernet0/1 receives the frame.
```

二： L2

```
1. The frame source MAC address was found in the MAC table of Multilayer Switch.
2. The frame destination MAC address matches the MAC address of the active VLAN interface.
3. The frame's destination MAC address matches the receiving port's MAC address, the broadcast address, or a multicast address.
4. The device decapsulates the PDU from the Ethernet frame.
```

#### 首次失败了，我们用pc4主动ping一下交换机再试试

我们的vlan1 没有设置ip吗？

步骤1 L3

```
1. The Ping process starts the next ping request.
2. The Ping process creates an ICMP Echo Request message and sends it to the lower process.
3. The source IP address is not specified. The device sets it to the port's IP address.
4. The destination IP address is in the same subnet. The device sets the next-hop to destination.
```

L2

```
1. The next-hop IP address is a unicast. The ARP process looks it up in the ARP table.
2. The next-hop IP address is not in the ARP table. The ARP process tries to send an ARP request for that IP address and buffers this packet.
```

嗯嗯，不知道交换机，aka网关。send 一个arp

那么交换机就收到这个arp了

在交换机的L1

```
1. FastEthernet0/2 receives the frame.
```

在交换机接收的L2

```
1. The frame source MAC address does not exist in the MAC table of Multilayer Switch. Multilayer Switch adds a new MAC entry to its table.
2. The frame destination MAC address is broadcast. The Multilayer Switch processes the frame.
3. The frame's destination MAC address matches the receiving port's MAC address, the broadcast address, or a multicast address.
4. The device decapsulates the PDU from the Ethernet frame.
5. The frame is an ARP frame. The ARP process processes it.
6. The ARP frame is a request.
7. The ARP request's target IP address matches the receiving port's IP address.
8. The ARP process updates the ARP table with received information.
```

在交换机的发送L2

```
1. The ARP process replies to the request with the receiving port's MAC address.
2. The device encapsulates the PDU into an Ethernet frame.
3. The Multilayer Switch uses the active VLAN interface as the outgoing VLAN number.
4. This is a unicast frame. Multilayer Switch looks in its MAC table for the destination MAC address.
5. The outgoing port is an access port. Multilayer Switch sends the frame out that port.
6. This is a broadcast frame. The Multilayer Switch sends out the frame to all ports in the same VLAN except the receiving port.
```


在发送的L1

```
1. FastEthernet0/2 sends out the frame.
2. FastEthernet0/3 sends out the frame.
```

对于PC5收到方向的L2

```
1. The frame's destination MAC address matches the receiving port's MAC address, the broadcast address, or a multicast address.
2. The device decapsulates the PDU from the Ethernet frame.
3. The frame is an ARP frame. The ARP process processes it.
4. The ARP frame is a request.
5. The ARP request's target IP address does not match the receiving port's IP address.
6. The ARP process drops the frame.
```

可以看到PC5不进行回复

对于PC4的L1

```
1. FastEthernet0 receives the frame.
```

而其L2

```
1. The frame's destination MAC address matches the receiving port's MAC address, the broadcast address, or a multicast address.
2. The device decapsulates the PDU from the Ethernet frame.
3. The frame is an ARP frame. The ARP process processes it.
4. The ARP frame is a reply.
5. The ARP process updates the ARP table with received information.
6. The ARP process takes out and sends buffer packets waiting for this ARP reply.
```

经过这一系列操作，啊哈哈，现在交换机的mac table 如下：

```
Switch#show mac address-table 
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----

   1    0001.974b.5859    DYNAMIC     Fa0/2
   2    0001.97c9.3987    DYNAMIC     Fa0/1
Switch#
```
#### 现在我们用pc 1 ping pc 4应该就OK了

在交换机 看看，送网关了

```
1. The frame source MAC address was found in the MAC table of Multilayer Switch.
2. The frame destination MAC address matches the MAC address of the active VLAN interface.
3. The frame's destination MAC address matches the receiving port's MAC address, the broadcast address, or a multicast address.
4. The device decapsulates the PDU from the Ethernet frame.
```

中间有STP报文的干扰，不要介意哈，还有什么CDB报文。

可以看到 第一次ping time out了，是因为交换机没给我们传到pc4

第二次也是：Request timed out.

第三次也是

妈的，这次也是全军覆没


或许我们需要静态路由配置一下







