# 2018-08-30

[TOC]

# 今天学习一些调试的思路from晓征

## 一些命令

```
 get   DROP_CONTROL_0 
 
 listreg  DROP_CONTROL_0

 listreg drop//模糊搜索

 port xe1 speed=1000//设置xe1的速度是1G，（原来是10G）

 ps //展示端口状态

 ```


### 强大：模糊搜索

```
sdk.0> listreg vlan
Unknown register; possible matches are:
  CMIC_PKT_VLAN EGR_EVLAN_SER_CONTROL EGR_PVLAN_EPORT_CONTROL 
  EGR_VLAN_CONTROL_1 EGR_VLAN_CONTROL_2 EGR_VLAN_CONTROL_3 
  EGR_VLAN_PDA_CTRL EGR_VLAN_RAM_CONTROL_1 EGR_VLAN_RAM_CONTROL_2 
  EGR_VLAN_RAM_CONTROL_3 EGR_VLAN_RAM_CONTROL_4 
  ING_NIV_RX_FRAMES_VLAN_TAGGED IVLAN_SER_CONTROL VLAN_CTRL 
  VLAN_MEMORY_DBGCTRL VLAN_PROTOCOL_DATA_DBGCTRL 
  VLAN_SUBNET_CAM_BIST_CONFIG VLAN_SUBNET_CAM_BIST_DBG_DATA 
  VLAN_SUBNET_CAM_BIST_STATUS VLAN_SUBNET_CAM_DBGCTRL 
  VLAN_SUBNET_DATA_DBGCTRL VLAN_TAG_ACTION_PROFILE_DBGCTRL 
  XMAC_RX_VLAN_TAG 
```

# 正确使用抓包机

```
user@ubuntu:~$ telnet 192.168.193.48
Trying 192.168.193.48...
Connected to 192.168.193.48.
Escape character is '^]'.

zrtlimt#show vlan
VLAN Name                             Status    Ports
---- -------------------------------- --------- -----------------------------------
   1 VLAN0001                         STATIC    Gi0/1, Gi0/2, Gi0/3, Gi0/4            
                                                Gi0/5, Gi0/6, Gi0/8, Gi0/9            
                                                Gi0/10, Gi0/11, Gi0/13, Gi0/14        
                                                Gi0/15, Gi0/16, Gi0/17, Gi0/18        
                                                Gi0/19, Gi0/20, Gi0/22, Gi0/23        
                                                Gi0/24, Gi0/25, Gi0/26, Gi0/27        
                                                Gi0/28, Gi0/29, Gi0/30, Gi0/31        
                                                Gi0/32, Gi0/33, Gi0/34, Gi0/35        
                                                Gi0/36, Gi0/37, Gi0/38, Gi0/39        
                                                Gi0/40, Gi0/41, Gi0/42, Gi0/43        
                                                Gi0/44, Gi0/45, Gi0/46, Gi0/47        
                                                Gi0/48, Te0/49, Te0/50, Te0/51        
                                                Te0/52                                
   2 VLAN0002                         STATIC    Gi0/5                                 
  10 VLAN0010                         STATIC    Gi0/5                                 
  20 VLAN0020                         STATIC    Gi0/5                                 
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#show in
zrtlimt#sh in co ra up
Interface    Sampling Time         Input Rate           Input Rate           Output Rate          Output Rate
                                   (bits/sec)           (packets/sec)        (bits/sec)           (packets/sec)
------------ --------------------- -------------------- -------------------- -------------------- --------------------
Gi0/1        5 seconds             0                    0                    52482                102                 
Gi0/2        5 seconds             52245                101                  200                  0                   
Gi0/21       5 seconds             142075               88                   963                  1                   
zrtlimt#cno
zrtlimt#cno

Translating "cno"...
% Unrecognized host or address, or protocol not running.
zrtlimt#con
zrtlimt#configure 
Enter configuration commands, one per line.  End with CNTL/Z.
zrtlimt(config)#in gi 0/1
zrtlimt(config-if-GigabitEthernet 0/1)#no sw
zrtlimt(config-if-GigabitEthernet 0/1)#no switchport 
zrtlimt(config-if-GigabitEthernet 0/1)#ip ad 1.0.0.1 24
zrtlimt(config-if-GigabitEthernet 0/1)#in gi 0/2
zrtlimt(config-if-GigabitEthernet 0/2)#no sw
zrtlimt(config-if-GigabitEthernet 0/2)#no switchport 
zrtlimt(config-if-GigabitEthernet 0/2)#ip ad 2.0.0.1 24
zrtlimt(config-if-GigabitEthernet 0/2)#end  
zrtlimt#co
Enter configuration commands, one per line.  End with CNTL/Z.
zrtlimt(config)#show ip tou                           
zrtlimt(config)#show ip ro 
zrtlimt(config)#show ip route 

Codes:  C - Connected, L - Local, S - Static
        R - RIP, O - OSPF, B - BGP, I - IS-IS, V - Overflow route
        N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
        E1 - OSPF external type 1, E2 - OSPF external type 2
        SU - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
        IA - Inter area, EV - BGP EVPN, * - candidate default

Gateway of last resort is no set
C     1.0.0.0/24 is directly connected, GigabitEthernet 0/1
C     1.0.0.1/32 is local host. 
C     2.0.0.0/24 is directly connected, GigabitEthernet 0/2
C     2.0.0.1/32 is local host. 
C     192.168.193.0/24 is directly connected, GigabitEthernet 0/21
C     192.168.193.48/32 is local host. 
zrtlimt(config)#exit          
zrtlimt#sh in co ra up
Interface    Sampling Time         Input Rate           Input Rate           Output Rate          Output Rate
                                   (bits/sec)           (packets/sec)        (bits/sec)           (packets/sec)
------------ --------------------- -------------------- -------------------- -------------------- --------------------
Gi0/1        5 seconds             0                    0                    0                    0                   
Gi0/2        5 seconds             49131                95                   0                    0                   
Gi0/21       5 seconds             23845                34                   610                  1                   
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#sh in co ra up
Interface    Sampling Time         Input Rate           Input Rate           Output Rate          Output Rate
                                   (bits/sec)           (packets/sec)        (bits/sec)           (packets/sec)
------------ --------------------- -------------------- -------------------- -------------------- --------------------
Gi0/1        5 seconds             0                    0                    117                  0                   
Gi0/2        5 seconds             51138                99                   117                  0                   
Gi0/21       5 seconds             32838                44                   949                  0                   
zrtlimt#
zrtlimt#
zrtlimt#sh in co ra up
Interface    Sampling Time         Input Rate           Input Rate           Output Rate          Output Rate
                                   (bits/sec)           (packets/sec)        (bits/sec)           (packets/sec)
------------ --------------------- -------------------- -------------------- -------------------- --------------------
Gi0/1        5 seconds             0                    0                    81                   0                   
Gi0/2        5 seconds             53522                103                  81                   0                   
Gi0/21       5 seconds             31823                45                   662                  0                   
zrtlimt#
zrtlimt#
zrtlimt#sh in co ra up
Interface    Sampling Time         Input Rate           Input Rate           Output Rate          Output Rate
                                   (bits/sec)           (packets/sec)        (bits/sec)           (packets/sec)
------------ --------------------- -------------------- -------------------- -------------------- --------------------
Gi0/1        5 seconds             0                    0                    81                   0                   
Gi0/2        5 seconds             53522                103                  81                   0                   
Gi0/21       5 seconds             31823                45                   662                  0                   
zrtlimt#
zrtlimt#
zrtlimt#sh in co ra up
Interface    Sampling Time         Input Rate           Input Rate           Output Rate          Output Rate
                                   (bits/sec)           (packets/sec)        (bits/sec)           (packets/sec)
------------ --------------------- -------------------- -------------------- -------------------- --------------------
Gi0/1        5 seconds             0                    0                    81                   0                   
Gi0/2        5 seconds             53522                103                  81                   0                   
Gi0/21       5 seconds             31823                45                   662                  0                   
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#con
zrtlimt#configure 
Enter configuration commands, one per line.  End with CNTL/Z.
zrtlimt(config)#show ip route 

Codes:  C - Connected, L - Local, S - Static
        R - RIP, O - OSPF, B - BGP, I - IS-IS, V - Overflow route
        N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
        E1 - OSPF external type 1, E2 - OSPF external type 2
        SU - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
        IA - Inter area, EV - BGP EVPN, * - candidate default

Gateway of last resort is no set
C     1.0.0.0/24 is directly connected, GigabitEthernet 0/1
C     1.0.0.1/32 is local host. 
C     2.0.0.0/24 is directly connected, GigabitEthernet 0/2
C     2.0.0.1/32 is local host. 
C     192.168.193.0/24 is directly connected, GigabitEthernet 0/21
C     192.168.193.48/32 is local host. 
zrtlimt(config)#              
zrtlimt(config)#
zrtlimt(config)#
zrtlimt(config)#
zrtlimt(config)#end           
zrtlimt#sh in co ra up
Interface    Sampling Time         Input Rate           Input Rate           Output Rate          Output Rate
                                   (bits/sec)           (packets/sec)        (bits/sec)           (packets/sec)
------------ --------------------- -------------------- -------------------- -------------------- --------------------
Gi0/1        5 seconds             0                    0                    0                    0                   
Gi0/2        5 seconds             1765                 3                    0                    0                   
Gi0/21       5 seconds             32223                51                   2141                 3                   
zrtlimt#sh in co ra up
Interface    Sampling Time         Input Rate           Input Rate           Output Rate          Output Rate
                                   (bits/sec)           (packets/sec)        (bits/sec)           (packets/sec)
------------ --------------------- -------------------- -------------------- -------------------- --------------------
Gi0/1        5 seconds             0                    0                    0                    0                   
Gi0/2        5 seconds             1765                 3                    0                    0                   
Gi0/21       5 seconds             32223                51                   2141                 3                   
zrtlimt#conf
zrtlimt#configure 
Enter configuration commands, one per line.  End with CNTL/Z.
zrtlimt(config)#arp 2.0.0.2 0000.0000.2222 arpa
zrtlimt(config)#
zrtlimt(config)#
zrtlimt(config)#
zrtlimt(config)#show ip route                  

Codes:  C - Connected, L - Local, S - Static
        R - RIP, O - OSPF, B - BGP, I - IS-IS, V - Overflow route
        N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
        E1 - OSPF external type 1, E2 - OSPF external type 2
        SU - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
        IA - Inter area, EV - BGP EVPN, * - candidate default

Gateway of last resort is no set
C     1.0.0.0/24 is directly connected, GigabitEthernet 0/1
C     1.0.0.1/32 is local host. 
C     2.0.0.0/24 is directly connected, GigabitEthernet 0/2
C     2.0.0.1/32 is local host. 
C     192.168.193.0/24 is directly connected, GigabitEthernet 0/21
C     192.168.193.48/32 is local host. 
zrtlimt(config)#end           
zrtlimt#sh in co ra up
Interface    Sampling Time         Input Rate           Input Rate           Output Rate          Output Rate
                                   (bits/sec)           (packets/sec)        (bits/sec)           (packets/sec)
------------ --------------------- -------------------- -------------------- -------------------- --------------------
Gi0/1        5 seconds             0                    0                    0                    0                   
Gi0/2        5 seconds             53110                103                  0                    0                   
Gi0/21       5 seconds             39499                57                   1201                 1                   
zrtlimt#
zrtlimt#sh in co ra up
Interface    Sampling Time         Input Rate           Input Rate           Output Rate          Output Rate
                                   (bits/sec)           (packets/sec)        (bits/sec)           (packets/sec)
------------ --------------------- -------------------- -------------------- -------------------- --------------------
Gi0/1        5 seconds             0                    0                    4                    0                   
Gi0/2        5 seconds             52496                102                  4                    0                   
Gi0/21       5 seconds             20071                32                   4                    0                   
zrtlimt#sh in co ra up
Interface    Sampling Time         Input Rate           Input Rate           Output Rate          Output Rate
                                   (bits/sec)           (packets/sec)        (bits/sec)           (packets/sec)
------------ --------------------- -------------------- -------------------- -------------------- --------------------
Gi0/1        5 seconds             0                    0                    4                    0                   
Gi0/2        5 seconds             52496                102                  4                    0                   
Gi0/21       5 seconds             20071                32                   4                    0                   
zrtlimt#sh in co ra up
Interface    Sampling Time         Input Rate           Input Rate           Output Rate          Output Rate
                                   (bits/sec)           (packets/sec)        (bits/sec)           (packets/sec)
------------ --------------------- -------------------- -------------------- -------------------- --------------------
Gi0/1        5 seconds             0                    0                    4                    0                   
Gi0/2        5 seconds             52496                102                  4                    0                   
Gi0/21       5 seconds             20071                32                   4                    0                   
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#sh in co ra up
Interface    Sampling Time         Input Rate           Input Rate           Output Rate          Output Rate
                                   (bits/sec)           (packets/sec)        (bits/sec)           (packets/sec)
------------ --------------------- -------------------- -------------------- -------------------- --------------------
Gi0/1        5 seconds             0                    0                    0                    0                   
Gi0/2        5 seconds             54510                106                  0                    0                   
Gi0/21       5 seconds             26758                43                   1094                 0                   
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#show sys   
00d0.f822.3535
zrtlimt#sh in co ra up
Interface    Sampling Time         Input Rate           Input Rate           Output Rate          Output Rate
                                   (bits/sec)           (packets/sec)        (bits/sec)           (packets/sec)
------------ --------------------- -------------------- -------------------- -------------------- --------------------
Gi0/1        5 seconds             0                    0                    0                    0                   
Gi0/2        5 seconds             50499                98                   0                    0                   
Gi0/21       5 seconds             36121                42                   0                    0                   
zrtlimt#
zrtlimt#
zrtlimt#              
zrtlimt#
zrtlimt#sh in co ra up
Interface    Sampling Time         Input Rate           Input Rate           Output Rate          Output Rate
                                   (bits/sec)           (packets/sec)        (bits/sec)           (packets/sec)
------------ --------------------- -------------------- -------------------- -------------------- --------------------
Gi0/1        5 seconds             0                    0                    0                    0                   
Gi0/2        5 seconds             51968                101                  46043                89                  
Gi0/21       5 seconds             83627                55                   1659                 1                   
zrtlimt#con
zrtlimt#configure 
Enter configuration commands, one per line.  End with CNTL/Z.
zrtlimt(config)#e  
% Ambiguous command: "e"

zrtlimt(config)#end
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#
zrtlimt#

```

## 抓包结果是LLDP？wtf

![](http://o6qns6y6x.bkt.clouddn.com/18-8-30/66824569.jpg)